In [35]:
import pandas as pd

data = {
    'Company': ['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
}
df = pd.DataFrame(data)
df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [36]:
by_company = df.groupby('Company')

In [37]:
by_company.mean(numeric_only=True)

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [38]:
by_company.sum(numeric_only=True)

           Sales
Company
Facebook     593
Google       320
Microsoft    464

In [39]:
by_company.std(numeric_only=True)

                Sales
Company
Facebook    75.660426
Google      56.568542
Microsoft  152.735065

In [40]:
by_company.count()

           Person  Sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [41]:
by_company.max()

            Person  Sales
Company
Facebook     Sarah    350
Google         Sam    200
Microsoft  Vanessa    340

In [42]:
by_company.min()

            Person  Sales
Company
Facebook      Carl    243
Google     Charlie    120
Microsoft      Amy    124

In [43]:
by_company.sum().loc['Facebook']

Person    CarlSarah
Sales           593
Name: Facebook, dtype: object

In [44]:
df.groupby('Company').describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [45]:
df.groupby('Company').describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [46]:
import pandas as pd

df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [4, 5, 6, 4],
    'col3': ['a', 'b', 'c', 'd']
})
df

   col1  col2 col3
0     1     4    a
1     2     5    b
2     3     6    c
3     4     4    d

In [47]:
df['col2'].unique()

array([4, 5, 6])

In [48]:
df['col2'].nunique()

3

In [49]:
df['col2'].value_counts()

col2
4    2
5    1
6    1
Name: count, dtype: int64

In [50]:
df['col3'].apply(len)

0    1
1    1
2    1
3    1
Name: col3, dtype: int64

In [51]:
df['col2'].apply(lambda x: x * 2)

0     8
1    10
2    12
3     8
Name: col2, dtype: int64

In [52]:
df.drop('col1', axis=1, inplace=True)
df

   col2 col3
0     4    a
1     5    b
2     6    c
3     4    d

In [54]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [55]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [56]:
df.sort_values(by='col2')

   col2 col3
0     4    a
3     4    d
1     5    b
2     6    c

In [57]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False